In [5]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

%matplotlib inline

In [6]:
marathon_2016 = pd.read_csv("./data/marathon_2016.csv")

In [7]:
marathon_2016

      Unnamed: 0  Overall    Bib                     Name      Time
0              0        1      1           Scott Wietecha  02:25:42
1              1        2      3            Brian Shelton  02:34:43
2              2        3   1047        Christopher Capps  02:38:43
3              3        4   1052             Jason Grimes  02:45:06
4              4        5   1046              David Adams  02:47:28
...          ...      ...    ...                      ...       ...
3837        3837    99999  21159               Beth Lyons  00:00:00
3838        3838    99999  25061          Aleksei Stevens  00:00:00
3839        3839    99999   6047          Lizzie Ziccardi  00:00:00
3840        3840    99999   2052             Adam Pastors  00:00:00
3841        3841    99999   2107  Anastasiya Christiansen  00:00:00

[3842 rows x 5 columns]

In [9]:
marathon_2017 = pd.read_csv("./data/marathon_2017.csv")

In [10]:
marathon_2017

      Unnamed: 0  Overall    Bib             Name      Time
0              0        1      1   Scott Wietecha  02:40:25
1              1        2   1145     Ryan Regnier  02:56:28
2              2        3   1147   Daniel Everett  03:00:55
3              3        4   1029    Khris Vickroy  03:04:47
4              4        5   1119   Marcus Dilallo  03:04:53
...          ...      ...    ...              ...       ...
3646        3646    99999   1185       Ernest Lee  00:00:00
3647        3647    99999   8038  Allison Alfonso  00:00:00
3648        3648    99999  26069   Justin Wehring  00:00:00
3649        3649    99999   8111   Timothy Forbes  00:00:00
3650        3650    99999   2084    Thomas Hansen  00:00:00

[3651 rows x 5 columns]

In [11]:
marathon_2018 = pd.read_csv("./data/marathon_2018.csv")

In [12]:
marathon_2018

      Unnamed: 0  Overall    Bib             Name      Time
0              0        1      1   Scott Wietecha  02:28:16
1              1        2      3     Garang Madut  02:29:52
2              2        3  33442       Kevin Fink  02:38:59
3              3        4  33441    Andrew Hodges  02:43:59
4              4        5  30028  Nicholas Aubert  02:48:11
...          ...      ...    ...              ...       ...
2110        2110    99999  33654      Jeff Ekkart  00:00:00
2111        2111    99999  31170   Austin Perkins  00:00:00
2112        2112    99999  30482      David Ramos  00:00:00
2113        2113    99999  33461   Emily Eagerton  00:00:00
2114        2114    99999  31515  Tony Quernemoen  00:00:00

[2115 rows x 5 columns]